{
    "personal_info": {
        "name": "Ruibo Liu",
        "age": 26,
        "location": "Guangzhou",
        "email": "rl3233@columbia.edu",
        "address": "Haizhu District, Guangzhou, Guangdong Province",
        "photo":"myprofile.jpg"
    },
    "education": [
        {
            "degree": "Master",
            "major": "Mechanical Engineering, Robotics and Control",
            "school": "Columbia University",
            "graduation_date": "02/2023",
            "gpa": "3.83/4.0"
        },
        {
            "degree": "Bachelor",
            "major": "Mechanical Engineering",
            "school": "University of California Los Angeles",
            "graduation_date": "06/2021",
            "gpa": "3.68/4.0"
        }
    ],
    "experience": [
        {
            "position": "R&D Engineer",
            "company": "Institute of Software Chinese Academy of Sciences, Guangzhou institute of software and application technology",
            "date": "04/2023 - 08/2024",
            "project": [
                {
                    "name":"AI Lab Scoring System for Middle Schools",
                    "date":"12/2023 - 06/2024",
                    "details":[
                        "Proposed a scoring algorithm framework based on middle school experimental standards in Shenzhen, with 15 AI scoring criteria.",
                        "Designed an adaptive scoring framework to meet user-defined criteria and scoring standards.",
                        "Utilized the YOLOv8 model to achieve object and action recognition with an accuracy exceeding 90% under stable recognition conditions.",
                        "Managed the database for the computer vision recognition model and handled the preprocessing and postprocessing workflows for training data, utilizing over 100,000 labeled images to train and optimize the model, achieving an accuracy rate exceeding 90% under laboratory conditions.",
                        "Supported the successful deployment of the project at the Chongqing Education Equipment Exhibition and schools in Sichuan, and Inner Mongolia."
                    ]
                },
                {
                    "name": "Smart Street Light Precision Operation and Maintenance Project",
                    "date": "05/2023 - 12/2023",
                    "details": [
                        "Processed daily operational data for over 10,000 smart streetlights based on government platforms and vendor data, conducting analysis through dimensionality reduction and data visualization techniques.",
                        "Utilized machine learning and deep learning algorithms, such as LSTM and decision trees, to detect faults in streetlights with over 90% accuracy.",
                        "Built a multi-model system for data cleaning, analysis, modeling, and prediction, reducing manual inspection costs."
                    ]
                },
                {
                    "name": "Digital Avatar APP based on Large Models",
                    "date": "05/2023 - 07/2023",
                    "details": [
                        "Collected and cleaned image data of various human figures, including annotations, to enhance model learning quality.",
                        "Fine-tuned the parameters of the Stable Diffusion model to train the LORA model based on the refined user-defined figures.",
                        "Generated speech from text using large AI models and text-to-speech technology.",
                        "Achieved real-time virtual human lip-syncing with voice using deep learning model on A800 servers.",
                        "Participated in the company's annual project roadshow, responsible for product demonstrations and explanations."
                    ]
                }

            ]
        }
    ],

    "project_experience":[
        {
            "from": "Columbia University Creative Machines Lab",
            "date": "05/2022 – 02/2023",
            "project":[
                {
                    "name":"Desktop Organizing Robot Arm",       
                    "details": [
                    "Improved the gripper and base design of the WidowX 200 robotic arm and created the URDF model.",
                    "Developed Socket programs to enable communication between the robot and the PyBullet simulator for synchronized operation in simulated and real environments.",
                    "Wrote Python scripts to collect over 100,000 images of blocks with different shapes, quantities, and poses on the desktop, and processed the images using the OpenCV library to meet the data requirements of deep learning.",
                    "Modified and trained the yolov7 and Resnet models to accurately identify different poses and numbers of LEGO blocks in an image for planning the robot arm's grasping path.",
                    "Designed a small neural network with Cartesian control to improve the operating accuracy of the robot arm in the real environment, significantly improving the grasping accuracy of the robot arm.",
                    "Worked with the mentor to be interviewed by The New York Times, responsible for introducing the robot arm project and demonstrating the robot arm movement process."
                    ]
                },
                {
                    "name":"Quadruped Self-Model Robot",
                    "details":[
                        "Developed Python scripts to automatically generate different robot models and checked whether the generated robot models could stand and walk.",
                        "Used genetic algorithms to study the gait of robots with different shapes and explored the movement forms of robots under different terrain friction.",
                        "Improved the internal circuit design of the robot to solve the overheating problem of servo motors.",
                        "Used Domain Randomization to reduce the gap between the simulator and reality and successfully instructed the physical robot to complete actual walking.",
                        "Developed Socket programs to enable communication between the robot and the IMU and computer, collected gait data of the physical robot, and used it for neural network training."
                    ]
                }
            ]
        },
        {
            "from":"Course: Robotic Studio, Columbia University",
            "date":"01/2022 - 05/2022",
            "project":[
                {
                "name":"Bipedal Rabbit Robot",
                "details":[
                    "Designed the 3D model of the robot using SolidWorks, assembled the circuits and robot after 3D printing, and tested its gait stability and energy consumption.",
                    "Built the model of the robot in the PyBullet simulator, optimized its gait using machine learning, and used Raspberry Pi to connect with the computer host for remote control, increasing the robot's walking speed from 3cm/s to 15cm/s."
                ]
                }
            ]
        },
        {
            "from":"Course: Machine Design, University of California Los Angeles",
            "date":"01/2021 - 06/2021",
            "project":[
                {
                "name":"Fully Automated Wardrobe Robot",
                "details":[
                    "Designed the wardrobe robot model that can carry clothes of different weights and styles using SolidWorks.",
                    "Designed a gear mechanism that can drive four mechanical linkages for handling clothes using only one motor, achieving the function of storing and delivering clothes.",
                    "Simulated the structural force of the robot using SolidWorks simulation system and adjusted the design according to the simulation results."
                ]
                }
            ]
        },
        {
            "from":"Design Build Fly Club, UCLA",
            "date":"10/2019 - 02/2020",
            "project":[
                {
                "name":"Remote Control Airplane Model",
                "details":[
                    "Used SolidWorks to simulate the aerodynamics around the wing to optimize the plane's design.",
                    "Tested different wing specifications and designs; defined the scale of test results, supervised and tested the entire process, and eventually improved the overall avionics performance.",
                    "Built airplane parts using 3D printing, laser cutting, CNC machining, etc., and participated in the assembly of the airplane."
                ]
                }
            ]
        }
    ],

    "internship":[
        {
        "position": "Intern Mechanical Engineer",
        "company": "QtPinchuang Technology Company | Beijing, China",
        "date": "07/2018 – 09/2018",
        "responsibilities": [
            "Reviewed CAD engineering drawings for the company's robot projects.",
            "Supervised the robot assembly process and conducted quality control for the assembled prototypes.",
            "Participated in the testing of the rope robot, provided technical advice, and documented the testing process and results."
            ]
        },
        {
        "position": "Intern",
        "company": "Guangdong Provincial Museum | Guangzhou, China",
        "date": "07/2017 – 10/2017",
        "responsibilities": [
            "Planned and conducted youth traditional culture experience projects, including activity content and budgeting.",
            "Designed tour projects within the museum and created maps and tour brochures using Autocad and Photoshop.",
            "Led more than 20 children participating in summer camp activities to build traditional Chinese buildings and vehicles (Shamian historical buildings and Guangzhou shipbuilding) using LEGO."
            ]
        }
    ],

    "skills": {
        "software": [
            "Python",
            "C++",
            "Matlab",
            "R Studio",
            "Microsoft office"
        ],
        "engineering_drawing": [
            "AutoCAD",
            "JLCEDA",
            "SolidWorks",
            "SolidCam",
            "OpenCAD"
        ],
        "languages": [
            "Mandarin (Proficient)",
            "Cantonese (Proficient)",
            "English (Proficient)"
        ],
        "others": {
            "name":"Docent Volunteer of Guangdon Museum Foreign Language Group",
            "description": "Completed over 110 hours of volunteer service from 2023-2024, responsible for conducting more than 10 English tours in the Guangdong history and culture exhibition and translating over 4,000 words of English papers"
        }
    }
}
